<template>
  <div class="border-4 rounded-xl pa-4">
    <div><strong>02. 약관동의</strong></div>
    <v-card class="pa-4" variant="flat">
      <v-tabs
          v-model="tab"

      >
        <v-tab value="1" class="bg-[#3f69fb] bg-opacity-70 ">취소수수료 특약</v-tab>
        <v-tab value="2" class="bg-">여행 약관</v-tab>
        <v-tab value="3">개인정보수집이용</v-tab>

        <v-tab value="4">고유식별정보수집이용</v-tab>
        <v-tab value="5">개인정보 제3자 제공</v-tab>
      </v-tabs>

      <v-card-text class="text-xs">
        <v-window v-model="tab">
          <v-window-item value="1">
            <div>
              <v-card
                  class="overflow-y-auto"
                  max-height="400"
              >

                <v-card-text class="text-xs">
                  <pre>{{ agreementList[0][0] }}</pre>
                </v-card-text>
              </v-card>
            </div>
          </v-window-item>

          <v-window-item value="2">
            <div>
              <v-card
                  class="overflow-y-auto"
                  max-height="400"
              >

                <v-card-text class="text-xs">
                  <pre>{{ agreementList[1][0] }}</pre>
                </v-card-text>
              </v-card>
            </div>
          </v-window-item>
          <v-window-item value="3">

            <v-card
                class="overflow-y-auto"
                max-height="400"
            >

              <v-card-text class="text-xs">
                <div
                    v-for="n in 12"
                    :key="n"
                    class="mb-4"
                >
                  Lorem ipsum dolor sit amet consectetur adipisicing elit. Modi commodi earum tenetur. Asperiores
                  dolorem placeat ab nobis iusto culpa, autem molestias molestiae quidem pariatur. Debitis beatae
                  expedita nam facere perspiciatis. Lorem ipsum dolor sit amet consectetur adipisicing elit. Repellendus
                  ducimus cupiditate rerum officiis consequuntur laborum doloremque quaerat ipsa voluptates, nobis nam
                  quis nulla ullam at corporis, similique ratione quasi illo!
                </div>
              </v-card-text>
            </v-card>
          </v-window-item>

          <v-window-item value="4">

            <v-card
                class="overflow-y-auto"
                max-height="400"
            >

              <v-card-text class="text-xs">
                <div
                    v-for="n in 12"
                    :key="n"
                    class="mb-4"
                >
                  Lorem ipsum dolor sit amet consectetur adipisicing elit. Modi commodi earum tenetur. Asperiores
                  dolorem placeat ab nobis iusto culpa, autem molestias molestiae quidem pariatur. Debitis beatae
                  expedita nam facere perspiciatis. Lorem ipsum dolor sit amet consectetur adipisicing elit. Repellendus
                  ducimus cupiditate rerum officiis consequuntur laborum doloremque quaerat ipsa voluptates, nobis nam
                  quis nulla ullam at corporis, similique ratione quasi illo!
                </div>
              </v-card-text>
            </v-card>
          </v-window-item>
          <v-window-item value="5">

            <v-card
                class="overflow-y-auto"
                max-height="400"
            >

              <v-card-text class="text-xs">
                <div
                    v-for="n in 12"
                    :key="n"
                    class="mb-4"
                >
                  Lorem ipsum dolor sit amet consectetur adipisicing elit. Modi commodi earum tenetur. Asperiores
                  dolorem placeat ab nobis iusto culpa, autem molestias molestiae quidem pariatur. Debitis beatae
                  expedita nam facere perspiciatis. Lorem ipsum dolor sit amet consectetur adipisicing elit. Repellendus
                  ducimus cupiditate rerum officiis consequuntur laborum doloremque quaerat ipsa voluptates, nobis nam
                  quis nulla ullam at corporis, similique ratione quasi illo!
                </div>
              </v-card-text>
            </v-card>
          </v-window-item>
        </v-window>
      </v-card-text>
    </v-card>
    <v-card-subtitle> *결제를 진행하면 모든 필수 약관에 동의함으로 갈음합니다.</v-card-subtitle>
  </div>
</template>

<script setup>
import {ref} from "vue";

const tab = ref()
const agreementList = [[
  "취소수수료 적용 기준: 특별약관\n" +
  "\n" +
  "                - 여행개시 30일 전까지 ( ~ 30) 통보 시 : 계약금 환급 (위약금 없이 계약 취소)\n" +
  "                - 여행개시 22일 전까지 (29 ~ 22) 통보 시 : 여행요금의 30% 배상\n" +
  "                - 여행개시 15일 전까지 (21 ~ 15) 통보 시 : 여행요금의 60% 배상\n" +
  "                - 여행개시 11일 전까지 (14 ~ 11) 통보 시 : 여행요금의 80% 배상\n" +
  "                - 여행개시 10일 전부터 당일 (10 ~ 당일) 통보 시 : 여행요금의 100% 배상\n" +
  "\n" +
  "                ※ 단, 항공권 및 일부 교통 수단의 승차권은 여행개시 전 미리 발권될 수 있습니다. 사전 발권된 항공권 및 일부 교통 수단의 승차권에 대한 수수료는 위 여행 취소수수료에 포함되지 않으며, 위 여행 취소수수료와 별도로 부과됩니다.\n" +
  "                자세히 보기를 통해 전체 취소수수료 적용 기준을 반드시 확인 부탁드립니다.\n" +
  "\n" +
  "                ■ 본 여행상품은 항공 또는 선박의 좌석, 숙박 객실의 일부 또는 전부, 기타 본 여행상품을 구성하는 각 개별 상품을 여행사가 미리 확보하고 이미 비용을 선납한 상품입니다. 따라서 취소 시에는 특별약관이 국외여행표준약관에 우선 적용됩니다.\n" +
  "                ■ 본 여행상품에 대한 취소수수료는 공정거래위원회에서 고시하는 소비자분쟁해결기준보다 높은 취소수수료가 부과됩니다.\n" +
  "                ■ 항공권은 취소 뿐 아니라 예약 변경 또는 재발행(한글명 또는 영문명 변경 등 사유 포함)의 경우에도 수수료가 부과됩니다. 이 경우 수수료는 여행 취소수수료에 포함되지 아니하며, 여행 취소수수료 부과 여부와 관계없이 별도 부과됩니다. 관련 사항은, 본 취소규정의 [항공권 규정 및 좌석안내] 부분의 세부내용을 반드시 확인하여 주시기 바랍니다.\n" +
  "                ■ 현지 교통 수단(지역간 항공, 열차, 선박 이동 등)이 포함된 상품의 경우 예약 즉시 승차권 발권이 이루어질 수 있습니다. 이 경우  여행 취소수수료 부과 여부와 관계없이 교통 수단에 대한 비용 100%가 별도 부과됩니다.\n" +
  "                ■ 당사의 귀책사유로 여행이 취소되는 경우에도 위 여행 취소수수료 비율을 적용하여 고객에게 배상하며, 이 경우 항공권 및 본 여행상품을 구성하는 각 개별 상품에 대한 수수료는 당사가 전부 부담합니다.\n" +
  "                ■ 본 여행상품은 청약에 대한 승인의 의사표시로써 예약금을 지불한 시점부터 계약이 성립되며, 계약해제 요청 시에는 귀책사유에 따라 취소수수료가 부과됩니다.\n" +
  "\n" +
  "                [항공권 규정 및 좌석안내]\n" +
  "\n" +
  "                ■ 항공권에 관한 사항은 항공사 규정이 본 취소규정에 우선하여 적용됩니다. 이에 따라 항공권은 발권 이후 취소하거나 재발행하는 경우, 본 취소규정에 따르는 여행 취소수수료와 관계없이 항공사 규정에 따라 수수료와 당사의 대행 수수료가 별도로 부과됩니다.\n" +
  "\n" +
  "                [비엣젯항공]\n" +
  "\n" +
  "                여행개시 10일 전 부터는 전액 환불 불가\n" +
  "                ■ 항공권 발권 후 예약 변경이나 재발행(한글 또는 영문 변경 포함)으로 인하여 발생되는 비용은 항공사 규정에 따릅니다.\n" +
  "\n" +
  "                - 비용의 면제 조건 : 사고 증명서, 국가적 질병으로 인한 위험시 등 항공사에서 인정하는 사유서 첨부시 면제됩니다.\n" +
  "                - 비엣젯항공에서는 탑승객 본인의 질병, 직계가족 사망 등으로 여행이 불가능하다고 판단하는 경우 크레딧쉘(1년안에 재사용 가능한 포인트 형태) 로 환불 진행하고 있습니다.\n" +
  "                (취소요청>증빙서류 제출>환불가능여부 본사 확인 후 담당자가 안내)\n" +
  "\n" +
  "                ■ 항공권 취소 및 환불 가능기간\n" +
  "                - 항공권 발권 후 익일부터 항공사 규정에 의해 소정의 수수료 제외 후 취소 및 환불 가능합니다.\n" +
  "                - 전세기 및 일부 특가 항공권은 발권 전인 경우라도 예약 확정 시부터 항공권 비용의 100% 취소수수료가 부과됩니다.\n" +
  "\n" +
  "                ■ 취소는 업무시간 내 접수 시 확인 및 적용이 가능합니다. 업무시간 외 접수한 경우에는 익일(영업일이 아닌 경우 다음 영업일)에 접수한 것으로 간주됩니다. 업무시간은 월요일~금요일 09:00~18:00 이며, 주말 및 공휴일 그리고 주중 09:00~18:00 외 시간은 업무시간에 해당되지 않습니다. (예. 토/일/월요일 출발상품은 금요일 업무 종료 전까지 취소 하셔야 합니다.)\n" +
  "\n" +
  "                ■ 고객은 계약 취소와 관련하여 취소수수료(여행사 인건비 포함) 부과 내역에 관한 구체적 증빙과 설명을 여행사에 요구할 수 있으며, 여행사는 관련 설명과 증빙을 제시하고 취소수수료 규정과 차액이 있는 경우 환급합니다. (단, 항공사 및 숙박업체 등의 증빙을 여행사가 확보하는 시점까지 고객에게 증빙 제공을 유예할 수 있습니다.)\n" +
  "\n" +
  "                ■ 최소 출발인원이 미충족되어 여행출발이 불가한 경우에는 국외여행표준약관 제17조에 따라 여행사는 여행출발 7일 전까지 여행계약을 해제하고 고객님께 통보하여 드립니다.\n" +
  "\n" +
  "                - 여행 개시 7일 전까지 계약 해제 통지 : 계약금 환급\n" +
  "                - 여행 개시 1일 전까지 계약 해제 통지 : 여행요금의 30% 배상\n" +
  "                - 여행 출발 당일 계약 해제 통지 : 여행요금의 50% 배상\n" +
  "                ※ 항공 및 호텔은 현지 사정에 따라 변경될 수 있으며, 최소출발인원이 구성되지 않으면, 여행이 취소될 수 있습니다."],
  [
    "1. 제1조(목적)\n" +
    "이 약관은 (주)겟모임(이하 ‘당사’라 함)과 여행자가 체결한 국외여행계약의 세부 이행 및 준수사항을 정함을 목적으로 합니다.\n" +
    "2. 제2조(용어의 정의)\n" +
    "여행의 종류 및 정의, 해외여행수속대행업의 정의는 다음과 같습니다.\n" +
    "1. 기획여행 : 당사가 미리 여행목적지 및 관광일정, 여행자에게 제공될 운송 및 숙식서비스 내용(이하 ‘여행서비스’라 함), 여행요금을 정하여 광고 또는 기타 방법으로 여행자를 모집하여 실시하는 여행.\n" +
    "2. 희망여행 : 여행자(개인 또는 단체)가 희망하는 여행조건에 따라 당사가 운송․숙식․관광 등 여행에 관한 전반적인 계획을 수립하여 실시하는 여행.\n" +
    "3. 해외여행 수속대행(이하 ‘수속대행계약’이라 함) : 당사가 여행자로부터 소정의 수속대행요금을 받기로 약정하고, 여행자의 위탁에 따라 다음에 열거하는 업무(이하 ‘수속대행업무’라 함)를 대행하는 것.\n" +
    "1) 사증, 재입국 허가 및 각종 증명서 취득에 관한 수속\n" +
    "2) 출입국 수속서류 작성 및 기타 관련업무\n" +
    "3. 제3조(당사와 여행자 의무)\n" +
    "① 당사는 여행자에게 안전하고 만족스러운 여행서비스를 제공하기 위하여 여행알선 및 안내․운송․숙박 등 여행계획의 수립 및 실행과정에서 맡은 바 임무를 충실히 수행하여야 합니다.\n" +
    "② 여행자는 안전하고 즐거운 여행을 위하여 여행자간 화합도모 및 당사의 여행질서 유지에 적극 협조하여야 합니다.\n" +
    "4. 제4조(계약의 구성)\n" +
    "① 여행계약은 여행계약서(붙임)와 여행약관․여행일정표(또는 여행 설명서)를 계약내용으로 합니다.\n" +
    "② 여행계약서에는 당사의 상호, 소재지 및 관광진흥법 제9조에 따른 보증보험 등의 가입(또는 영업보증금의 예치 현황) 내용이 포함되어야 합니다.\n" +
    "③ 여행일정표(또는 여행설명서)에는 여행일자별 여행지와 관광내용․교통수단․쇼핑횟수․숙박장소․식사 등 여행실시일정 및 당사 제공 서비스 내용과 여행자 유의사항이 포함되어야 합니다.\n" +
    "5. 제5조(계약체결의 거절)\n" +
    "당사는 여행자에게 다음 각 호의 1에 해당하는 사유가 있을 경우에는 여행자와의 계약체결을 거절할 수 있습니다.\n" +
    "1. 질병, 신체이상 등의 사유로 개별관리가 필요하거나, 단체여행(다른 여행자의 여행에 지장을 초래하는 등)의 원활한 실시에 지장이 있다고 인정되는 경우\n" +
    "2. 계약서에 명시한 최대행사인원이 초과된 경우\n" +
    "6. 제6조(특약)\n" +
    "당사와 여행자는 관련법규에 위반되지 않는 범위 내에서 서면(전자문서를 포함한다. 이하 같다)으로 특약을 맺을 수 있습니다. 이 경우 당사는 특약의 내용이 표준약관과 다르고 표준약관보다 우선 적용됨을 여행자에게 설명하고 별도의 확인을 받아야 합니다.\n" +
    "7. 제7조(계약서 등 교부 및 안전정보 제공)\n" +
    "당사는 여행자와 여행계약을 체결한 경우 계약서와 약관 및 여행일정표(또는 여행설명서)를 각 1부씩 여행자에게 교부하고, 여행목적지에 관한 안전정보를 제공하여야 합니다. 또한 여행 출발 전 해당 여행지에 대한 안전정보가 변경된 경우에도 변경된 안전정보를 제공하여야 합니다.\n" +
    "8. 제8조(계약서 및 약관 등 교부 간주)\n" +
    "다음 각 호의 경우 여행계약서와 여행약관 및 여행일정표(또는 여행설명서)가 교부된 것으로 간주합니다.\n" +
    "1. 여행자가 인터넷 등 전자정보망으로 제공된 여행계약서, 약관 및 여행일정표(또는 여행설명서)의 내용에 동의하고 여행계약의 체결을 신청한 데 대해 당사가 전자정보망 내지 기계적 장치 등을 이용하여 여행자에게 승낙의 의사를 통지한 경우\n" +
    "2. 당사가 팩시밀리 등 기계적 장치를 이용하여 제공한 여행계약서, 약관 및 여행일정표(또는 여행설명서)의 내용에 대하여 여행자가 동의하고 여행계약의 체결을 신청하는 서면을 송부한 데 대해 당사가 전자정보망 내지 기계적 장치 등을 이용하여 여행자에게 승낙의 의사를 통지한 경우\n" +
    "9. 제9조(당사의 책임)\n" +
    "당사는 여행 출발시부터 도착시까지 당사 본인 또는 그 고용인, 현지여행사 또는 그 고용인 등(이하 ‘사용인’이라 함)이 제3조제1항에서 규정한 당사 임무와 관련하여 여행자에게 고의 또는 과실로 손해를 가한 경우 책임을 집니다.\n" +
    "10. 제10조(여행요금)\n" +
    "① 여행계약서의 여행요금에는 다음 각 호가 포함됩니다. 다만, 희망여행은 당사자간 합의에 따릅니다.\n" +
    "1. 항공기, 선박, 철도 등 이용운송기관의 운임(보통운임기준)\n" +
    "2. 공항, 역, 부두와 호텔사이 등 송영버스요금\n" +
    "3. 숙박요금 및 식사요금\n" +
    "4. 안내자경비\n" +
    "5. 여행 중 필요한 각종세금\n" +
    "6. 국내외 공항․항만세\n" +
    "7. 관광진흥개발기금\n" +
    "8. 일정표내 관광지 입장료\n" +
    "9. 기타 개별계약에 따른 비용\n" +
    "② 제1항에도 불구하고 반드시 현지에서 지불해야 하는 경비가 있는 경우 그 내역과 금액을 여행계약서에 별도로 구분하여 표시하고, 당사는 그 사유를 안내하여야 합니다.\n" +
    "③ 여행자는 계약체결시 계약금(여행요금 중 10%이하 금액)을 당사에게 지급하여야 하며, 계약금은 여행요금 또는 손해배상액의 전부 또는 일부로 취급합니다.\n" +
    "④ 여행자는 제1항의 여행요금 중 계약금을 제외한 잔금을 여행출발 7일전까지 당사에게 지급하여야 합니다.\n" +
    "⑤ 여행자는 제1항의 여행요금을 당사자가 약정한 바에 따라 카드, 계좌이체 또는 무통장입금 등의 방법으로 지급하여야 합니다.\n" +
    "⑥ 희망여행요금에 여행자 보험료가 포함되는 경우 당사는 보험회사명, 보상내용 등을 여행자에게 설명하여야 합니다.\n" +
    "11. 제11조(여행요금의 변경)\n" +
    "① 국외여행을 실시함에 있어서 이용운송․숙박기관에 지급하여야 할 요금이 계약체결시보다 5%이상 증감하거나 여행요금에 적용된 외화환율이 계약체결시보다 2% 이상 증감한 경우 당사 또는 여행자는 그 증감된 금액 범위 내에서 여행요금의 증감을 상대방에게 청구할 수 있습니다.\n" +
    "② 당사는 제1항의 규정에 따라 여행요금을 증액하였을 때에는 여행출발일 15일전에 여행자에게 통지하여야 합니다.\n" +
    "12. 제12조(여행조건의 변경요건 및 요금 등의 정산)\n" +
    "① 계약서 등에 명시된 여행조건은 다음 각 호의 1의 경우에 한하여 변경될 수 있습니다.\n" +
    "1. 여행자의 안전과 보호를 위하여 여행자의 요청 또는 현지사정에 의하여 부득이하다고 쌍방이 합의한 경우\n" +
    "2. 천재지변, 전란, 정부의 명령, 운송‧숙박기관 등의 파업‧휴업 등으로 여행의 목적을 달성할 수 없는 경우\n" +
    "② 당사가 계약서 등에 명시된 여행일정을 변경하는 경우에는 해당 날짜의 일정이 시작되기 전에 여행자의 서면 동의를 받아야 합니다. 이때 서면동의서에는 변경일시, 변경내용, 변경으로 발생하는 비용이 포함되어야 합니다.\n" +
    "③ 천재지변, 사고, 납치 등 긴급한 사유가 발생하여 여행자로부터 여행일정 변경 동의를 받기 어렵다고 인정되는 경우에는 제2항에 따른 일정변경 동의서를 받지 아니할 수 있습니다. 다만, 당사는 사후에 서면으로 그 변경 사유 및 비용 등을 설명하여야 합니다.\n" +
    "④ 제1항의 여행조건 변경 및 제11조의 여행요금 변경으로 인하여 제10조 제1항의 여행요금에 증감이 생기는 경우에는 여행출발 전 변경 분은 여행출발 이전에, 여행 중 변경 분은 여행종료 후 10일 이내에 각각 정산(환급)하여야 합니다.\n" +
    "⑤ 제1항의 규정에 의하지 아니하고 여행조건이 변경되거나 제16조 내지 제18조의 규정에 의한 계약의 해제․해지로 인하여 손해배상액이 발생한 경우에는 여행출발 전 발생 분은 여행출발이전에, 여행 중 발생 분은 여행종료 후 10일 이내에 각각 정산(환급)하여야 합니다.\n" +
    "⑥ 여행자는 여행출발 후 자기의 사정으로 숙박, 식사, 관광 등 여행요금에 포함된 서비스를 제공받지 못한 경우 당사에게 그에 상응하는 요금의 환급을 청구할 수 없습니다. 다만, 여행이 중도에 종료된 경우에는 제18조에 준하여 처리합니다.\n" +
    "13. 제13조(여행자 지위의 양도)\n" +
    "① 여행자가 개인사정 등으로 여행자의 지위를 양도하기 위해서는 당사의 승낙을 받아야 합니다. 이때 당사는 여행자 또는 여행자의 지위를 양도받으려는 자가 양도로 발생하는 비용을 지급할 것을 조건으로 양도를 승낙할 수 있습니다.\n" +
    "② 전항의 양도로 발생하는 비용이 있을 경우 당사는 기한을 정하여 그 비용의 지급을 청구하여야 합니다.\n" +
    "③ 당사는 계약조건 또는 양도하기 어려운 불가피한 사정 등을 이유로 제1항의 양도를 승낙하지 않을 수 있습니다.\n" +
    "④ 제1항의 양도는 당사가 승낙한 때 효력이 발생합니다. 다만, 당사가 양도로 인해 발생한 비용의 지급을 조건으로 승낙한 경우에는 정해진 기한 내에 비용이 지급되는 즉시 효력이 발생합니다.\n" +
    "⑤ 여행자의 지위가 양도되면, 여행계약과 관련한 여행자의 모든 권리 및 의무도 그 지위를 양도 받는 자에게 승계됩니다.\n" +
    "14. 제14조(당사의 하자담보 책임)\n" +
    "① 여행자는 여행에 하자가 있는 경우에 당사에게 하자의 시정 또는 대금의 감액을 청구할 수 있습니다. 다만, 그 시정에 지나치게 많은 비용이 들거나 그 밖에 시정을 합리적으로 기대할 수 없는 경우에는 시정을 청구할 수 없습니다.\n" +
    "② 여행자는 시정 청구, 감액 청구를 갈음하여 손해배상을 청구하거나 시정 청구, 감액 청구와 함께 손해배상을 청구 할 수 있습니다.\n" +
    "③ 제1항 및 제2항의 권리는 여행기간 중에도 행사할 수 있으며, 여행종료일부터 6개월 내에 행사하여야 합니다.\n" +
    "15. 제15조(손해배상)\n" +
    "① 당사는 현지여행사 등의 고의 또는 과실로 여행자에게 손해를 가한 경우 당사는 여행자에게 손해를 배상하여야 합니다.\n" +
    "② 당사의 귀책사유로 여행자의 국외여행에 필요한 사증, 재입국 허가 또는 각종 증명서 등을 취득하지 못하여 여행자의 여행일정에 차질이 생긴 경우 당사는 여행자로부터 절차대행을 위하여 받은 금액 전부 및 그 금액의 100%상당액을 여행자에게 배상하여야 합니다.\n" +
    "③ 당사는 항공기, 기차, 선박 등 교통기관의 연발착 또는 교통체증 등으로 인하여 여행자가 입은 손해를 배상하여야 합니다. 다만, 당사가 고의 또는 과실이 없음을 입증한 때에는 그러하지 아니합니다.\n" +
    "④ 당사는 자기나 그 사용인이 여행자의 수하물 수령, 인도, 보관 등에 관하여 주의를 해태(懈怠)하지 아니하였음을 증명하지 아니하면 여행자의 수하물 멸실, 훼손 또는 연착으로 인한 손해를 배상할 책임을 면하지 못합니다.\n" +
    "16. 제16조(여행출발 전 계약해제)\n" +
    "① 당사 또는 여행자는 여행출발전 이 여행계약을 해제할 수 있습니다. 이 경우 발생하는 손해액은 ‘소비자분쟁해결기준’(공정거래위원회 고시)에 따라 배상합니다.\n" +
    "② 당사 또는 여행자는 여행출발 전에 다음 각 호의 1에 해당하는 사유가 있는 경우 상대방에게 제1항의 손해배상액을 지급하지 아니하고 이 여행계약을 해제할 수 있습니다.\n" +
    "1. 당사가 해제할 수 있는 경우\n" +
    "가. 제12조 제1항 제1호 및 제2호 사유의 경우\n" +
    "나. 여행자가 다른 여행자에게 폐를 끼치거나 여행의 원활한 실시에 현저한 지장이 있다고 인정될 때\n" +
    "다. 질병 등 여행자의 신체에 이상이 발생하여 여행에의 참가가 불가능한 경우\n" +
    "라. 여행자가 계약서에 기재된 기일까지 여행요금을 납입하지 아니한 경우\n" +
    "2. 여행자가 해제할 수 있는 경우\n" +
    "가. 제12조 제1항 제1호 및 제2호의 사유가 있는 경우\n" +
    "나. 당사가 제21조에 따른 공제 또는 보증보험에 가입하지 아니 하였거나 영업보증금을 예치하지 않은 경우\n" +
    "다. 여행자의 3촌 이내 친족이 사망한 경우\n" +
    "라. 질병 등 여행자의 신체에 이상이 발생하여 여행에의 참가가 불가능한 경우\n" +
    "마. 배우자 또는 직계존비속이 신체이상으로 3일 이상 병원(의원)에 입원하여 여행 출발 전까지 퇴원이 곤란한 경우 그 배우자 또는 보호자 1인\n" +
    "바. 당사의 귀책사유로 계약서 또는 여행일정표(여행설명서)에 기재된 여행일정대로의 여행실시가 불가능해진 경우\n" +
    "사. 제10조제1항의 규정에 의한 여행요금의 증액으로 인하여 여행 계속이 어렵다고 인정될 경우\n" +
    "17-1. 제17조(최저행사인원 미 충족시 계약해제)\n" +
    "① 당사는 최저행사인원이 충족되지 아니하여 여행계약을 해제하는 경우 여행출발 7일전까지 여행자에게 통지하여야 합니다.\n" +
    "② 당사가 여행참가자 수 미달로 전항의 기일내 통지를 하지 아니하고 계약을 해제하는 경우 이미 지급받은 계약금 환급 외에 다음 각 목의 1의 금액을 여행자에게 배상하여야 합니다.\n" +
    "가. 여행출발 1일전까지 통지시 : 여행요금의 30%\n" +
    "나. 여행출발 당일 통지시 : 여행요금의 50%\n" +
    "17-2. 제17조의 2(감염병의 발생으로 당사 또는 여행자의 계약해제)\n" +
    "① 감염병 등의 발생으로 아래 각 호의 1에 해당하는 사유가 있는 경우 ‘당사’ 또는 여행자는 제 16조 제 1항의 손해배상액을 지급하지 아니하고 계약해제를 할 수 있습니다.\n" +
    "1. 외국정부가 우리 국민에 대해 입국금지‧격리조치 등 이에 준하는 명령을 발령하여 계약을 이행할 수 없는 경우\n" +
    "2. 계약체결 이후 외교부가 여행지역·국가에 여행경보 3단계(철수권고)‧4단계(여행금지)를 발령하여 계약을 이행할 수 없는 경우\n" +
    "3. 항공‧철도‧선박 등의 운항이 중단되어 계약을 이행할 수 없는 경우\n" +
    "② 계약체결 이후 외교부가 여행지역·국가에 특별여행주의보를 발령하거나 세계보건기구(WHO)가 감염병 경보 5단계 또는 6단계(세계적 대유행, 펜데믹)를 선언하여 계약을 이행하기 상당히 어려운 경우에는 ‘당사’ 또는 ‘여행자’는 계약해제를 할 수 있으며, 제 16조 제 1항의 손해배상액의 50%를 감경합니다. (단, 세계보건기구(WHO)가 감염병 경보 5단계를 선언한 경우는 감염병이 발생한 해당지역에 한함)\n" +
    "18. 제18조(여행출발 후 계약해지)\n" +
    "당사 또는 여행자는 여행출발 후 부득이한 사유가 있는 경우 각 당사자는 여행계약을 해지할 수 있습니다. 다만, 그 사유가 당사자 한쪽의 과실로 인하여 생긴 경우에는 상대방에게 손해를 배상하여야 합니다.\n" +
    "② 제1항에 따라 여행계약이 해지된 경우 귀환운송 의무가 있는 당사는 여행자를 귀환운송 할 의무가 있습니다.\n" +
    "③ 제1항의 계약해지로 인하여 발생하는 추가 비용은 그 해지사유가 어느 당사자의 사정에 속하는 경우에는 그 당사자가 부담하고, 양 당사자 누구의 사정에도 속하지 아니하는 경우에는 각 당사자가 추가 비용의 50%씩을 부담합니다.\n" +
    "④ 여행자는 여행에 중대한 하자가 있는 경우에 그 시정이 이루어지지 아니하거나 계약의 내용에 따른 이행을 기대할 수 없는 경우에는 계약을 해지할 수 있습니다.\n" +
    "⑤ 제4항에 따라 계약이 해지된 경우 당사는 대금청구권을 상실합니다. 다만, 여행자가 실행된 여행으로 이익을 얻은 경우에는 그 이익을 당사에게 상환하여야 합니다.\n" +
    "⑥ 제4항에 따라 계약이 해지된 경우 당사는 계약의 해지로 인하여 필요하게 된 조치를 할 의무를 지며, 계약상 귀환운송 의무가 있으면 여행자를 귀환운송하여야 합니다. 이 경우 귀환운송비용은 원칙적으로 당사가 부담하여야 하나, 상당한 이유가 있는 때에는 당사는 여행자에게 그 비용의 일부를 청구할 수 있습니다.\n" +
    "19. 제19조(여행의 시작과 종료)\n" +
    "여행의 시작은 탑승수속(선박인 경우 승선수속)을 마친 시점으로 하며, 여행의 종료는 여행자가 입국장 보세구역을 벗어나는 시점으로 합니다. 다만, 계약내용상 국내이동이 있을 경우에는 최초 출발지에서 이용하는 운송수단의 출발시각과 도착시각으로 합니다.\n" +
    "20. 제20조(설명의무)\n" +
    "당사는 계약서에 정하여져 있는 중요한 내용 및 그 변경사항을 여행자가 이해할 수 있도록 설명하여야 합니다.\n" +
    "21. 제21조(보험가입 등)\n" +
    "당사는 이 여행과 관련하여 여행자에게 손해가 발생한 경우 여행자에게 보험금을 지급하기 위한 보험 또는 공제에 가입하거나 영업보증금을 예치하여야 합니다.\n" +
    "22. 제22조(기타사항)\n" +
    "① 이 계약에 명시되지 아니한 사항 또는 이 계약의 해석에 관하여 다툼이 있는 경우에는 당사 또는 여행자가 합의하여 결정하되, 합의가 이루어지지 아니한 경우에는 관계법령 및 일반관례에 따릅니다.\n" +
    "② 특수지역에의 여행으로서 정당한 사유가 있는 경우에는 이 표준약관의 내용과 달리 정할 수 있습니다."
  ]
]
</script>

<style scoped>

</style>